24-sessions-cookies/app/controllers/carts_controller.rb

  def update
    # byebug
    @nacho = Nacho.find(params[:nacho_id])
---
SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]